; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-14)
(:domain gripper-strips)
(:objects rooma roomb room3 room4 room5 room6 left right ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 ball14 )
(:init
(room rooma)
(room roomb)
(room room3)
(room room4)
(room room5)
(room room6)
(gripper left)
(gripper right)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(ball ball6)
(ball ball7)
(ball ball8)
(ball ball9)
(ball ball10)
(ball ball11)
(ball ball12)
(ball ball13)
(ball ball14)
(free left)
(free right)
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 roomb)
(at ball6 roomb)
(at ball7 room3)
(at ball8 room3)
(at ball9 room3)
(at ball10 room3)
(at ball11 room4)
(at ball12 room5)
(at ball13 room5)
(at ball14 room6)
(at-robby rooma)
)
(:goal
(and
(at ball1 room3)
(at ball2 room3)
(at ball3 room3)
(at ball4 room3)
(at ball5 room3)
(at ball6 room3)
(at ball7 room3)
(at ball8 room3)
(at ball9 room3)
(at ball10 room3)
(at ball11 room3)
(at ball12 room3)
(at ball13 room3)
(at ball14 room3)
)
)
)

; plan
1. (pick ball4 rooma left)
   deleted: (at ball4 rooma) (free left)
   added: (carry ball4 left)
   goals met: 4 of 14
2. (pick ball3 rooma right)
   deleted: (at ball3 rooma) (free right)
   added: (carry ball3 right)
   goals met: 4 of 14
3. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 4 of 14
4. (drop ball3 room3 right)
   deleted: (carry ball3 right)
   added: (at ball3 room3) (free right)
   goals met: 5 of 14
5. (drop ball4 room3 left)
   deleted: (carry ball4 left)
   added: (at ball4 room3) (free left)
   goals met: 6 of 14
6. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 6 of 14
7. (pick ball6 roomb left)
   deleted: (at ball6 roomb) (free left)
   added: (carry ball6 left)
   goals met: 6 of 14
8. (pick ball5 roomb right)
   deleted: (at ball5 roomb) (free right)
   added: (carry ball5 right)
   goals met: 6 of 14
9. (move roomb room6)
   deleted: (at-robby roomb)
   added: (at-robby room6)
   goals met: 6 of 14
10. (move room6 room3)
   deleted: (at-robby room6)
   added: (at-robby room3)
   goals met: 6 of 14
11. (drop ball5 room3 right)
   deleted: (carry ball5 right)
   added: (at ball5 room3) (free right)
   goals met: 7 of 14
12. (drop ball6 room3 left)
   deleted: (carry ball6 left)
   added: (at ball6 room3) (free left)
   goals met: 8 of 14
13. (move room3 room6)
   deleted: (at-robby room3)
   added: (at-robby room6)
   goals met: 8 of 14
14. (pick ball14 room6 left)
   deleted: (at ball14 room6) (free left)
   added: (carry ball14 left)
   goals met: 8 of 14
15. (move room6 room5)
   deleted: (at-robby room6)
   added: (at-robby room5)
   goals met: 8 of 14
16. (pick ball13 room5 right)
   deleted: (at ball13 room5) (free right)
   added: (carry ball13 right)
   goals met: 8 of 14
17. (move room5 room3)
   deleted: (at-robby room5)
   added: (at-robby room3)
   goals met: 8 of 14
18. (drop ball13 room3 right)
   deleted: (carry ball13 right)
   added: (at ball13 room3) (free right)
   goals met: 9 of 14
19. (drop ball14 room3 left)
   deleted: (carry ball14 left)
   added: (at ball14 room3) (free left)
   goals met: 10 of 14
20. (move room3 room5)
   deleted: (at-robby room3)
   added: (at-robby room5)
   goals met: 10 of 14
21. (pick ball12 room5 left)
   deleted: (at ball12 room5) (free left)
   added: (carry ball12 left)
   goals met: 10 of 14
22. (move room5 room4)
   deleted: (at-robby room5)
   added: (at-robby room4)
   goals met: 10 of 14
23. (pick ball11 room4 right)
   deleted: (at ball11 room4) (free right)
   added: (carry ball11 right)
   goals met: 10 of 14
24. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 10 of 14
25. (drop ball11 room3 right)
   deleted: (carry ball11 right)
   added: (at ball11 room3) (free right)
   goals met: 11 of 14
26. (drop ball12 room3 left)
   deleted: (carry ball12 left)
   added: (at ball12 room3) (free left)
   goals met: 12 of 14
27. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 12 of 14
28. (pick ball2 rooma left)
   deleted: (at ball2 rooma) (free left)
   added: (carry ball2 left)
   goals met: 12 of 14
29. (pick ball1 rooma right)
   deleted: (at ball1 rooma) (free right)
   added: (carry ball1 right)
   goals met: 12 of 14
30. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 12 of 14
31. (drop ball2 room3 left)
   deleted: (carry ball2 left)
   added: (at ball2 room3) (free left)
   goals met: 13 of 14
32. (drop ball1 room3 right)
   deleted: (carry ball1 right)
   added: (at ball1 room3) (free right)
   goals met: 14 of 14
